app/controllers/companies_controller.rb

  def create
    @company = Company.new(company_params)

    respond_to do |format|
      if @company.save
---
INSERT INTO "companies" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "company 4"], ["created_at", "2019-06-30 07:23:24.908050"], ["updated_at", "2019-06-30 07:23:24.908050"]]

  def show_import
    @companies = Company.all
---
SELECT "companies".* FROM "companies"