app/models/employee.rb

SELECT "employees"."email", "employees"."id" FROM "employees" WHERE (employees.parent_id is null)
---
  scope :boss_employees_data, -> { where("employees.parent_id is null").pluck(:email, :id).to_h }

SELECT  "employees".* FROM "employees" WHERE "employees"."email" = ? LIMIT ?  [["email", "jon@example.com"], ["LIMIT", 1]]
SELECT  1 AS one FROM "employees" WHERE "employees"."email" = ? LIMIT ?  [["email", "jon@example.com"], ["LIMIT", 1]]
UPDATE "employees" SET "lft" = CASE WHEN "lft" BETWEEN 2 AND 2 THEN "lft" + 4 - 2 WHEN "lft" BETWEEN 3 AND 4 THEN "lft" + 2 - 3 ELSE "lft" END, "rgt" = CASE WHEN "rgt" BETWEEN 2 AND 2 THEN "rgt" + 4 - 2 WHEN "rgt" BETWEEN 3 AND 4 THEN "rgt" + 2 - 3 ELSE "rgt" END, "parent_id" = CASE WHEN "id" = 6 THEN 5 ELSE "parent_id" END, updated_at = '2019-06-30 14:49:22.956509' WHERE "employees"."id" IN (SELECT "employees"."id" FROM "employees" WHERE ("employees"."lft" BETWEEN 2 AND 4 OR "employees"."rgt" BETWEEN 2 AND 4) ORDER BY "employees"."lft" ASC)
---
	def self.add_or_get_employees(data = [], parent_id='', company_id)
		return [] if data.blank? || data[0].blank?
		employee = Employee.find_or_initialize_by(email: data[1])
		if employee.new_record?
			employee.name = data[0]
			employee.phone = data[2]
			employee.company_id = company_id
			employee.parent_id = parent_id.to_i unless parent_id.blank?
			if employee.save!