app/models/policy.rb

  def self.add_or_get_policies(data=[], company_id)
		return [] if data.blank? || data[4].blank?
		policy_cont = []
		policy_data = data[4].split("|").map {|x| x.strip }
		policy_data.each do |poly|
			policy = Policy.find_or_initialize_by(name: poly)
			if policy.new_record?
				policy.company_id = company_id
				if policy.save!
					policy_cont << policy
---
SELECT  "policies".* FROM "policies" WHERE "policies"."name" = ? LIMIT ?  [["name", "Sick Leave"], ["LIMIT", 1]]
INSERT INTO "policies" ("name", "company_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Sick Leave"], ["company_id", 3], ["created_at", "2019-06-30 14:49:06.534883"], ["updated_at", "2019-06-30 14:49:06.534883"]]